Repository: ajolayemi/irrigazione_iot
Catalog: app/lib/src/localization/app_*.arb
Languages: it

# signInButtonTitle
source: Sign In
it: Accedi

# emailFormHint
source: example@example.com
it: esempio@esempio.com

# forgotPasswordButtonTitle
source: Forgot Password?
it: Password dimenticata?

# orSignWithText
source: or sign in with
it: oppure accedi con

# invalidEmailErrorText
source: Invalid email
it: Indirizzo email non valido

# emptyEmailErrorText
source: Email can''t be empty
it: Il campo email non può essere vuoto

# shortPasswordErrorText
source: Password is too short, it has to be a minimum of {minPasswordLength} characters
it: La password inserita è troppo corta, deve essere minimo {minPasswordLength} caratteri

# emptyPasswordErrorText
source: Password can''t be empty
it: Il campo password non può essere vuoto

# settingsPageTitle
source: Settings
it: Impostazione

# morePageTitle
source: More
it: Altro

# collectorPageTitle
source: Collectors
it: Collettori

# pumpPageTitle
source: Pumps
it: Pompe

# sectorPageTitle
source: Sectors
it: Settori

# graphsPageTitle
source: Graphs
it: Grafici

# chooseCompany
source: Choose a company
it: Scegli un'azienda

# welcome
source: Welcome, {username}!
it: Ciao, {username}!

# genericSaveButtonLabel
source: Save
it: Salva

# genericUpdateButtonLabel
source: Update
it: Aggiorna

# alertDialogCancel
source: Cancel
it: Annulla

# alertDialogConfirm
source: Confirm
it: Conferma

# alertDialogDelete
source: Delete
it: Elimina

# logInWithAnotherAccount
source: Change Account
it: Cambia account

# onStatusUpdateAlertDialogContent
source: You''re about to switch on {name}
it: Stai per accendere {name}

# offStatusUpdateAlertDialogContent
source: You''re about to switch off {name}
it: Stai per spegnere {name}

# onStatusDialogConfirmButtonTitle
source: Switch On
it: Accendi

# offStatusDialogConfirmButtonTitle
source: Switch Off
it: Spegni

# genericAlertDialogTitle
source: Are you sure?
it: Sei sicuro?

# statusListTileTitle
source: Current Status
it: Stato Attuale

# noCompanyFoundForUser
source: Hello {username}! There is no company associated with your account in our database
it: Ciao {username}! Non ci risultano aziende associate al tuo account nel nostro database

# addNewPumpPageTitle
source: New Pump
it: Nuova Pompa

# updatePumpPageTitle
source: Update Pump
it: Aggiorna Pompa

# pumpNameFormHint
source: eg: Pompa Giardino
it: es: Pompa Giardino

# pumpVolumeCapacityFormFieldTitle
source: Volume capacity
it: Portata volumetrica

# pumpVolumeCapacityFormHint
source: eg: 1000
it: es: 1000

# pumpKwFormFieldTitle
source: Power (kW)
it: Consumo energetico (kW)

# pumpKwFormHint
source: eg: 50
it: es: 50

# onCommandFormFieldTitle
source: On command
it: Comando di accensione

# onCommandFormHint
source: eg: 1
it: es: 1

# offCommandFormFieldTitle
source: Off command
it: Comando di spegnimento

# offCommandFormHint
source: eg: 2
it: es: 2

# formGenericSaveDialogTitle
source: Do you want to save the data?
it: Vuoi salvare i dati?

# formGenericUpdateDialogTitle
source: Do you want to update the data?
it: Vuoi aggiornare i dati?

source: not available
it: Non disponibile

# deleteConfirmationDialogTitle
source: Clicking on delete will remove all data related to {name} from database
it: Cliccando su elimina, verranno cancellati tutti i dati relativi {name}

# sectorLastIrrigation
source: last irrigation {when}
it: Ultima irrigazione: {when}

# sectorNameHintText
source: eg: ME8
it: es: ME8

# sectorSpecieHintText
source: select a specie...
it: seleziona una specie...

# sectorVariety
source: Variety
it: Varietà

# sectorVarietyHintText
source: select a variety...
it: seleziona una varietà...

# sectorOccupiedArea
source: Occupied area
it: Area occupata

# sectorOccupiedAreaHintText
source: eg: 100
it: es: 100

# sectorNumberOfPlants
source: Number of plants
it: Numero di piante

# sectorNumberOfPlantsHintText
source: eg: 100
it: es: 100

# sectorUnitConsumptionPerHour
source: Consumption per plant (l/h)
it: Consumo per pianta (l/h)

# sectorUnitConsumptionPerHourHintText
source: eg: 1
it: es: 1

# sectorTotalConsumption
source: Total consumption (l/h)
it: Consumo totale (l/h)

# sectorIrrigationSystem
source: Irrigation system
it: Sistema di irrigazione

# sectorIrrigationSource
source: Irrigation source
it: Fonte di irrigazione

# sectorNotes
source: Notes
it: Note

# sectorConnectedPumps
source: Connected pump
it: Pompa Collegata

# sectorLastIrrigationEmpty
source: Never irrigated
it: Mai irrigato

# sectorLastIrrigationForTile
source: Last irrigated
it: Ultima Irrigazione

# addSectorPageTitle
source: New Sector
it: Nuovo Settore

# updateSectorPageTitle
source: Update Sector
it: Aggiorna Settore

source: Select a specie
it: Seleziona una specie

source: Select an option
it: Seleziona un'opzione

# commandAlreadyInUseErrorText
source: This command value is already in use for another {fieldName}
it: Questo comando è già in uso per {fieldName}

# duplicateCommandsInFormErrorText
source: You can''t use the same command to switch on and switch off {fieldName}
it: Non puoi usare lo stesso comando per spegnere e accendere {fieldName}

# fieldTooLongErrorText
source: Field value is too long, it has to be a maximum of {max} characters
it: Il nome inserito è troppo lungo, deve essere massimo {max} caratteri

# emptyFormFieldErrorText
source: Field can''t be empty
it: Il campo non può essere vuoto

# notANumberErrorText
source: Field has to be a number
it: Il campo deve essere un numero

# notGreaterThanZeroErrorText
source: Field has to be greater than 0
it: Il campo deve essere maggiore di zero

# fieldValueAlreadyInUseErrorText
source: This value is already in use for another {fieldName}
it: Il valore inserito è già in uso per {fieldName}

# nPumps
source: {n, plural, =1{pump} =2{pumps} other {pumps}}
it: {n, plural, =1{pompa} =2{pompe} other{pompe}}

# nPumpsWithIndefiniteArticle
source: {n, plural, =1{a pump} =2{pumps} other {pumps}}
it: {n, plural, =1{una pompa} =2{delle pompe} other{delle pompe}}

# nPumpsWithDefiniteArticle
source: {n, plural, =1{the pump} =2{pumps} other {pumps}}
it: {n, plural, =1{la pompa} =2{le pompe} other{le pompe}}

# nSectors
source: {n, plural, =1{sector} =2{sectors} other {sectors}}
it: {n, plural, =1{settore} =2{settori} other{settori}}

# nSectorsWithIndefiniteArticle
source: {n, plural, =1{a sector} =2{sectors} other {sectors}}
it: {n, plural, =1{un settore} =2{dei settori} other{dei settori}}

# nSectorsWithDefiniteArticle
source: {n, plural, =1{the sector} =2{sectors} other {sectors}}
it: {n, plural, =1{il settore} =2{i settori} other{i settori}}

# nPumpsWithArticulatedPreposition
source: {n, plural, =1{the pump} =2{the pumps} other {the pumps}}
it: {n, plural, =1{alla pompa} =2{alle pompe} other {alle pompe}}

# nSectorsWithArticulatedPreposition
source: {n, plural, =1{the sector} =2{the sectors} other {the sectors}}
it: {n, plural, =1{al settore} =2{ai settori} other {ai settori}}

# emptyDataPlaceholder
source: No {name} was found in the database
it: Non risulta alcun {name} nel database

# addNewButtonLabel
source: Add New
it: Aggiungi

# connectPumpToSectorPageTile
source: Select a pump
it: Seleziona una pompa

# noPumpConnectedToSectorErrorText
source: You have to connect at least one pump to this sector
it: Devi collegare almeno una pompa a questo settore

# pumpLastDispensationForTile
source: Was last switched on
it: Ultima Erogazione

# pumpLastDispensationEmpty
source: Never switched on
it: Mai accesa

# pumpTotalDispensedLitres
source: Total litres dispensed
it: Litri erogati nel tempo

# nCollectors
source: {n, plural, =1{collector} =2{collectors} other{collectors}}
it: {n, plural, =1{collettore} =2{collettori} other{collettori}}

# nCollectorsWithIndefiniteArticle
source: {n, plural, =1{a collector} =2{collectors} other{collectors}}
it: {n, plural, =1{un collettore} =2{dei collettori} other{dei collettori}}

# nCollectorsWithDefiniteArticle
source: {n, plural, =1{the collector} =2{collectors} other{collectors}}
it: {n, plural, =1{il collettore} =2{i collettori} other{i collettori}}

# nCollectorsWithArticulatedPreposition
source: {n, plural, =1{the collector} =2{the collectors} other{the collectors}}
it: {n, plural, =1{al collettore} =2{ai collettori} other {ai collettori}}

# addNewCollectorPageTitle
source: New Collector
it: Nuovo Collettore

# updateCollectorPageTitle
source: Update Collector
it: Aggiorna Collettore

# collectorFilterName
source: Filter (filtro) name
it: Nome Filtro

# nSelectedSectors
source: {n, plural, =0{0 sectors selected} =1{1 sector selected} other{{n} sectors selected}}
it: {n, plural, =0{0 settori selezionati} =1{1 settore selezionato} other{{n} settori selezionati}}

# connectSectorToCollectorPageTitle
source: Select Sectors
it: Seleziona Settori

# collectorConnectedSectors
source: Connected sectors
it: Settori Collegati

# noSectorConnectedToCollectorErrorText
source: You have to connect at least one sector to this collector
it: Devi collegare almeno un settore a questo collettore

# genericConfirmButtonLabel
source: Confirm
it: Conferma

# allSectorsAreConnectedToACollector
source: All available sectors have already been connected to a collector
it: Tutti i settori sono stati già collegati a un collettore

# nConnectedSectors
source: {n, plural, =0{0 sectors connected} =1{1 sector connected} other{{n} sectors connected}}
it: {n, plural, =0{0 settori collegati} =1{1 settore collegato} other{{n} settori collegati}}

# filterPressureDifference
source: Filter diff:
it: Diff filtri:

# iotBoardsMenuTitle
source: Boards
it: Centraline

# settingsMenuTitle
source: Settings
it: Impostazioni

# profilePageTitle
source: My Profile
it: Il mio profilo

# logOutButtonTitle
source: Logout
it: Esci

# logOutAlertDialogTitle
source: Are you sure you want to log out?
it: Sei sicuro di voler uscire dall'applicazione?

# logOutAlertDialogContent
source: You will be logged out of the application
it: Cliccando su 'Logout' verrai disconnesso dall'applicazione

# logOutAlertDialogConfirm
source: Logout
it: Esci

# nBoards
source: {n, plural, =1{board} =2{boards} other{boards}}
it: {n, plural, =1{centralina} =2{centraline} other{centraline}}

# nBoardsWithIndefiniteArticle
source: {n, plural, =1{a board} =2{boards} other{boards}}
it: {n, plural, =1{una centralina} =2{delle centraline} other{delle centraline}}

# nBoardsWithDefiniteArticle
source: {n, plural, =1{the board} =2{boards} other{boards}}
it: {n, plural, =1{la centralina} =2{le centraline} other{le centraline}}

# nBoardsWithArticulatedPreposition
source: {n, plural, =1{the board} =2{the boards} other{the boards}}
it: {n, plural, =1{alla centralina} =2{alle centraline} other {alle centraline}}

# addNewBoardPageTitle
source: New Board
it: Nuova Centralina

# updateBoardPageTitle
source: Update Board
it: Aggiorna Centralina

# boardModel
source: Model
it: Modello

# boardSerialNumber
source: Serial number
it: Numero di Serie

# boardConnectedCollector
source: Connected Collector
it: Collettore Collegato

# boardConnectedCollectorHintText
source: Select a collector
it: Seleziona un collettore

# allCollectorsAreConnectedToABoard
source: All available collectors have already been connected to a board
it: Tutti i collettori sono stati già collegati a una centralina

# connectCollectorToBoardPageTitle
source: Select a collector
it: Seleziona un collettore

# nSelectedCollectors
source: {n, plural, =0{0 collectors selected} =1{1 collector selected} other{{n} collectors selected}}
it: {n, plural, =0{0 collettori selezionati} =1{1 collettore selezionato} other{{n} collettori selezionati}}

# noCollectorConnectedToBoardErrorText
source: You have to connect at least one collector to this board
it: Devi collegare almeno un collettore a questa centralina

# userProfileDetailsName
source: Names
it: Nome

# userProfileDetailsEmail
source: Email
it: Indirizzo email

# userProfileDetailsCurrentCompany
source: Current company profile
it: Profilo aziendale attuale

# companyProfileMenuTitle
source: Company Profile
it: Profilo Aziendale

# companyUsersMenuTitle
source: My Company Users
it: Utenti Aziendali

# companyNameHintText
source: eg: My Company
it: eg: azienda agricola esempio srl

# companyRegisteredAddress
source: Registered office address
it: Sede Legale

# companyRegisteredAddressHintText
source: eg: 123 Main Street, 12345, City, Country
it: eg: via roma 1, 00100, roma

# companyVatNumber
source: VAT number
it: Partita IVA

# companyFiscalCode
source: Fiscal code
it: Codice Fiscale

# companyEmail
source: Email
it: Indirizzo email aziendale

# companyPhone
source: Phone
it: Telefono Aziendale

# dependentFieldsEmptyErrorText
source: One between {firstFieldName} and {secondFieldName} has to be filled
it: Uno tra {firstFieldName} e {secondFieldName} deve essere compilato

# addNewCompanyPageTitle
source: New Company
it: Nuova Azienda

# updateCompanyPageTitle
source: Update Company
it: Aggiorna Azienda

# nCompany
source: {n, plural, =1{company} =2{companies} other{companies}}
it: {n, plural, =1{azienda} =2{aziende} other{aziende}}

# noUsersConnectedWithCompany
source: You have no registered users associated with your company
it: Non ci sono utenti associati a questa azienda

# companyUserFullName
source: Full name
it: Nome e cognome

# companyUserFullNameHintTest
source: eg: John Doe
it: eg: Francesco Rossi

# companyUserEmail
source: Email
it: Indirizzo email

# companyUserRole
source: Assign a role
it: Assegna un ruolo

# companyUserRoleHintText
source: Select a role
it: Seleziona un ruolo

# companyUserAssignedRoleForDetails
source: Assigned role
it: Ruolo assegnato

# companyUserAddedOn
source: Added on
it: Aggiunto il

# companyUserLastUpdated
source: Last updated
it: Ultimo aggiornamento

# addNewCompanyUserPageTitle
source: New User
it: Nuovo Utente

# updateCompanyUserPageTitle
source: Update User
it: Aggiorna Utente

# emailAlreadyInUseErrorText
source: This email is already in use
it: Questo indirizzo email è già in uso

# nCompanyUsers
source: {n, plural, =1{company user} =2{company users} other{company users}}
it: {n, plural, =1{utente aziendale} =2{utenti aziendali} other{utenti aziendali}}

# assignRoleDialogTitle
source: Assign a role
it: Assegna un ruolo

source: Me
it: Io

# companyUserDismissalDialogTitle
source: Are you sure you want to delete this user?
it: Sei sicuro di voler eliminare questo utente?

# companyUserDismissalDialogContent
source: You''re about to delete {companyUserName} as a user
it: Stai per eliminare {companyUserName} come utente

# cantDeleteYourselfDialogTitle
source: You can''t delete yourself as a user
it: Non puoi eliminare te stesso come utente

# noUppercaseInPasswordErrorText
source: Password has to contain at least one uppercase letter
it: La password deve contenere almeno una lettera maiuscola

# noLowercaseInPasswordErrorText
source: Password has to contain at least one lowercase letter
it: La password deve contenere almeno una lettera minuscola

# noNumberInPasswordErrorText
source: Password has to contain at least one number
it: La password deve contenere almeno un numero

# noSpecialCharacterInPasswordErrorText
source: Password has to contain at least one special character
it: La password deve contenere almeno un carattere speciale

# passwordsDoNotMatchErrorText
source: Passwords do not match
it: Le password non corrispondono

# invalidCredentialsErrorText
source: The email or password you entered is incorrect
it: La password o l'indirizzo email inseriti non sono corretti

# introductorySignInText
source: Sign in with your registered account details to continue
it: Accedi con le tue credenziali per continuare

# noAccountText
source: Don''t have an account?
it: Non hai un account?

# signUpText
source: Sign Up
it: Registrati

# signUpButtonTitle
source: Sign Up
it: Registrati

# confirmPasswordFormFieldTitle
source: Confirm password
it: Conferma Password

# alreadyHaveAnAccountText
source: Already have an account?
it: Hai già un account?

# nameFormFieldTitle
source: Name
it: Nome

# nameFormHint
source: John
it: Mario

# surnameFormFieldTitle
source: Surname
it: Cognome

# surnameFormHint
source: Doe
it: Rossi

# signInPageIntroductoryTitleText
source: Welcome back!
it: Benvenuto!

# signUpPageIntroductoryTitleText
source: Get started with us!
it: Inizia con noi!

# signUpPageIntroductorySubtitleText
source: Create your account
it: Crea il tuo account

# signInPageIntroductorySubtitleText
source: Sign into your account to continue
it: Accedi al tuo account per continuare

# mqttMessageNameFormFieldTitle
source: Alias name in MQTT message
it: Nome nei messaggi MQTT

# mqttMessageNameFormHint
source: alias name in mqtt msgs...
it: nome nei msg mqtt...

# itemHasFilter
source: Has a filter connected?
it: Dispone di un filtro?

# selectAPumpHintText
source: select a pump...
it: seleziona una pompa...

# selectAVarietyPageTitle
source: Select a variety
it: Seleziona una varietà

# selectAnOptionHintText
source: select an option...
it: seleziona un'opzione...

# formGenericUpdateDialogContent
source: You''re about to update the data for {fieldName} in the database
it: Questa operazione sovrascriverà i dati esistenti per {fieldName} nel database

# formGenericSaveDialogContent
source: You''re about to save the data for {fieldName} in the database
it: Stai per salvare i dati per {fieldName} nel database

# mqttTopicNameFormFieldTitle
source: Name in MQTT topic
it: Nome nei topic MQTT

# mqttTopicNameFormHint
source: alias name in mqtt topic...
it: nome nei topic mqtt...

source: Switch On
it: Accendi

source: Switch Off
it: Spegni

# entityCharacteristics
source: Characteristics
it: Caratteristiche

# entityStatistics
source: Statistics
it: Statistiche

source: Yes
it: Sì

# mqttOnCommand
source: On Command (MQTT)
it: Commando di accensione (MQTT)

# mqttOffCommand
source: Off Command (MQTT)
it: Commando di spegnimento (MQTT)

source: Last filter in pressure
it: Ultima pressione in ingresso

source: Last filter out pressure
it: Ultima pressione in uscita

source: Last filter pressure difference
it: Differenza pressione filtri

source: Pressure
it: Pressione

# sensorPageTitle
source: Sensors
it: Sensori

# nSensors
source: {n, plural, =1{sensor} =2{sensors} other{sensors}}
it: {n, plural, =1{sensore} =2{sensori} other{sensori}}

# nSensorsWithIndefiniteArticle
source: {n, plural, =1{a sensor} =2{sensors} other{sensors}}
it: {n, plural, =1{un sensore} =2{dei sensori} other{dei sensori}}

# nSensorsWithDefiniteArticle
source: {n, plural, =1{the sensor} =2{sensors} other{sensors}}
it: {n, plural, =1{il sensore} =2{i sensori} other{i sensori}}

# nSensorsWithArticulatedPreposition
source: {n, plural, =1{the sensor} =2{the sensors} other{the sensors}}
it: {n, plural, =1{al sensore} =2{ai sensori} other {ai sensori}}

# addSensorPageTitle
source: New Sensor
it: Nuovo Sensore

# updateSensorPageTitle
source: Update Sensor
it: Aggiorna Sensore

source: Air Temperature
it: Temperatura dell'aria

source: Air Humidity
it: Umidità dell'aria

source: Light Intensity
it: Intensità luminosa

source: Barometric Pressure
it: Pressione barometrica

source: Wind Direction
it: Direzione del vento

source: Wind Speed
it: Velocità del vento

source: Rainfall Hourly
it: Pioggia oraria

source: UV Index
it: Indice UV

source: Device EUI
it: EUI del dispositivo

# sensorsMenuTitle
source: Sensors
it: Sensori

source: Last updated
it: Ultimo aggiornamento

source: Connected sector
it: Settore collegato

# historyPageTitle
source: History
it: Storico

source: No history
it: Nessun dato disponibile

source: Register your company
it: Registra la tua azienda

source: Login to your account
it: Accedi al tuo account

# welcomePageIntro
source: We''re glad to have you here! Please select an option to continue
it: Siamo lieti di darti il benvenuto! Per continuare, seleziona un'opzione

source: or
it: oppure

# companyCreatedSuccessfully
source: Your company has been created successfully!
it: Azienda creata con successo!
